Revit 2027 API
ParameterTypeId.HeavyEndPen Property
 "Heavy End Pen Weight"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId HeavyEndPen { get; }
Public Shared ReadOnly Property HeavyEndPen As ForgeTypeId
	Get
public:
static property ForgeTypeId^ HeavyEndPen {
	ForgeTypeId^ get ();
}
static member HeavyEndPen : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace